In [2]:
import pandas as pd

In [81]:
df = pd.DataFrame(
    {"a":[4,5,6],
    "b":[7,8,9],
    "c":[10,11,12]},
    index = [1,2,3]
)

In [82]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
df.loc[3,"a"]

6

In [8]:
df.loc[[1,2],["a","b"]]

   a  b
1  4  7
2  5  8

In [9]:
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [17]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6],
    "b" : [7, 8, 9, 9],
    "c" : [10, 11, 12, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2),('e',3)],
    names=['n','v']))

df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [12]:
#============= subset Observations (특정 행의 값을 뽑아 오는것) C행 시리얼에 10인
#데이터를 가지고 온다

In [14]:
df[df['c'] == 10]

     a  b   c
n v
d 1  4  7  10

In [19]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [21]:
df.drop_duplicates() # 중복된 시리얼 값을 제거해준다,.
df.drop_duplicates? #drop_duplicates에 쓰는 벙법을 알수 있다.

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [41]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [42]:
df[df["b"] !=8 ] # 이런식으로 논리 연산을 할수도 있다.

     a  b   c
n v
d 1  4  7  10
e 2  6  9  12
  3  6  9  12

In [49]:
df[df.a.isin([5])] #a라는 컬럼에 5가 있는지 없는지 판단

     a  b   c
n v
d 2  5  8  11

In [108]:
import numpy as np # null값을 넣어줌
df = pd.DataFrame({"a":[4,5,6,6,np.nan],
                   "b":[7,8,np.nan,9,9],
                   "c":[10,11,12,np.nan,12]},
                   index = pd.MultiIndex.from_tuples(
                   [('a',1),('d',2),('e',2),('e',3),('e',4)],
                   names=['n','v']))
df
# numpy.nan 을 해주어 NaN 값을 넣어준다

       a    b     c
n v
a 1  4.0  7.0  10.0
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [110]:
pd.isnull(df) # 널인 값은 True로 찍히는것을 확인할수 있다.

         a      b      c
n v
a 1  False  False  False
d 2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [126]:
df[df["a"].isnull()] #a 시리얼중에 널인 행 값을 반환한다.

      a    b     c
n v
e 4 NaN  9.0  12.0

* & (and), |(or) , ~(not) , ^(xor) , any()(any) , all()(all)

In [133]:
df.all()

a    True
b    True
c    True
dtype: bool

In [140]:
#파이썬에서 논리 ex) True and True = True
#판다스 논리 '&'
# ex)
df[df.b == 7] | df[df.a == 5]

      a   b   c
n v
a 1 NaN NaN NaN
d 2 NaN NaN NaN

In [141]:
type(df)

pandas.core.frame.DataFrame